[
  {
    "word": "Bandwidth",
    "seq": 1,
    "transcription": "/ˈbændwɪdθ/",
    "description": "The maximum data transfer rate of a network or internet connection.",
    "partOfSpeech": "noun",
    "category": "Network Terms",
    "translation_es": "Ancho de banda",
    "translation_ru": "Полоса пропускания",
    "translation_de": "Bandbreite",
    "translation_it": "Larghezza di banda",
    "translation_fr": "Bande passante",
    "synonyms": "Throughput, Capacity, Data rate",
    "phrases": "Increase bandwidth, Bandwidth limitations, Bandwidth requirements",
    "sentence": "When a network experiences high traffic, the **bandwidth** can become strained, leading to slower speeds for users; therefore, businesses should monitor their **bandwidth** to ensure optimal performance during peak hours and avoid potential disruptions.",
    "dialog": "I noticed our video call keeps lagging. Is it a problem with our **bandwidth**?; It might be. We have a lot of devices connected right now and it's possible our **bandwidth** is being stretched thin. Let me check if we’re using our full capacity.; That would be great. I heard we can upgrade our **bandwidth** to handle more devices. What do you think?; Upgrading our **bandwidth** could definitely help, especially during busy hours when multiple users are online."
  },
  {
    "word": "Encryption",
    "seq": 2,
    "transcription": "/ɪnˈkrɪpʃən/",
    "description": "The process of converting information into a code to prevent unauthorized access.",
    "partOfSpeech": "Noun",
    "category": "Security Terms",
    "translation_es": "Cifrado",
    "translation_ru": "Шифрование",
    "translation_de": "Verschlüsselung",
    "translation_it": "Crittografia",
    "translation_fr": "Chiffrement",
    "synonyms": "Encoding, Scrambling, Concealment",
    "phrases": "Data encryption is crucial for security, Encryption algorithms protect sensitive information, Companies rely on encryption for safe communications",
    "sentence": "In today's digital world, **encryption** is vital, as it protects our data from unauthorized access. Without **encryption**, sensitive information could easily be intercepted and misused by malicious actors, making encryption methods essential for safeguarding privacy and trust.",
    "dialog": "Have you heard about the latest developments in **encryption** technology? It's fascinating how fast things are evolving!; Yes! **Encryption** is becoming more important as data breaches happen quite frequently these days. What do you think is the best practice for using it?; I believe using strong algorithms is key, and it's important to keep encryption keys secure. You can’t just rely on **encryption** alone. It's part of a larger security strategy.; Absolutely! And educating users about the importance of **encryption** in protecting their data can make a significant difference."
  },
  {
    "word": "Firewall",
    "seq": 3,
    "transcription": "ˈfaɪərˌwɔːl",
    "description": "A system designed to prevent unauthorized access to or from a network.",
    "partOfSpeech": "noun",
    "category": "Security Terms",
    "translation_es": "Cortafuegos",
    "translation_ru": "Защитная стена",
    "translation_de": "Firewall",
    "translation_it": "Firewall",
    "translation_fr": "Pare-feu",
    "synonyms": "Barrier, Protector, Shield",
    "phrases": "Configure the **firewall** settings, The **firewall** blocked suspicious traffic, Install a **firewall** for better security",
    "sentence": "In today's digital age, a **firewall** is essential for protecting sensitive information from unauthorized access, as it regulates incoming and outgoing network traffic. Without a **firewall**, systems are left vulnerable to attacks, emphasizing the need for robust network security measures.",
    "dialog": "You heard about that new data breach?; Yes, it really highlights the importance of having a strong **firewall** in place. You think that’s enough?; A strong **firewall** is vital, but it’s also important to maintain good security practices."
  },
  {
    "word": "Gateway",
    "seq": 4,
    "transcription": "/ˈɡeɪtweɪ/",
    "description": "A network node that serves as an access point to another network.",
    "partOfSpeech": "noun",
    "category": "Network Terms",
    "translation_es": "Puerta de enlace",
    "translation_ru": "Шлюз",
    "translation_de": "Gateway",
    "translation_it": "Gateway",
    "translation_fr": "Passerelle",
    "synonyms": "Portal, Access point, Junction",
    "phrases": "The internet gateway is down, A security gateway protects our network, He accessed the gateway for network configuration.",
    "sentence": "The **gateway** acts as a critical access point between two networks, allowing information to flow between them seamlessly. Without a functioning **gateway**, communication can be significantly hampered, leading to delays in data transfer and potential security risks.",
    "dialog": "Have you checked the status of the **gateway**? I think it might be malfunctioning due to the recent updates; I was also concerned about the configuration of the **gateway** after we installed the new firewall. If the **gateway** is down, users won’t be able to connect to the external network; that's true, we can troubleshoot the **gateway** settings from our end."
  },
  {
    "word": "Database",
    "seq": 5,
    "transcription": "/ˈdeɪtəbeɪs/",
    "description": "A structured collection of data stored and accessed electronically.",
    "partOfSpeech": "Noun",
    "category": "General IT Terms",
    "translation_es": "Base de datos",
    "translation_ru": "База данных",
    "translation_de": "Datenbank",
    "translation_it": "Database",
    "translation_fr": "Base de données",
    "synonyms": "Data store, Data repository, Information system",
    "phrases": "Relational database management, Cloud database storage, Database administration",
    "sentence": "In modern businesses, a **database** serves as an essential resource for managing critical information. A well-designed **database** allows for efficient access, processing, and control of vast amounts of data, which ultimately enhances operational efficiency and decision-making.",
    "dialog": "Have you seen the new **database** system they implemented for the project?; Yes, I heard it streamlines data entry and retrieval significantly. I've been learning about the features of the **database**; That's great! Understanding it will help us improve our reporting and analytics."
  }
]